Revit 2027 API
Document.IsInEditMode Method
 Indicates if the document is in an edit mode.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsInEditMode()
Public Function IsInEditMode As Boolean
public:
bool IsInEditMode()
member IsInEditMode : unit -> bool
Return Value
Boolean
 Returns true if the document is in an edit mode, false otherwise.
See Also
Reference
Document Class
Autodesk.Revit.DB Namespace